Revit 2027 API
MEPSpaceConstruction.DeleteConstruction Method
Remove an existing construction from Space constructions.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DeleteConstruction(
	MEPBuildingConstruction pCurrentConstruction
)
Public Sub DeleteConstruction (
	pCurrentConstruction As MEPBuildingConstruction
)
public:
void DeleteConstruction(
	MEPBuildingConstruction^ pCurrentConstruction
)
member DeleteConstruction :
        pCurrentConstruction : MEPBuildingConstruction -> unit
Parameters
pCurrentConstruction MEPBuildingConstruction
The Construction will be deleted.
See Also
Reference
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace